Publ/Teoria/DataStruct/Stack.html
<!doctype html>
<html lang="en">
<head>
<title></title>
<!-- 2022-10-08 Sat 18:56 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<meta name="generator" content="Org-mode">
<meta name="author" content="J.D Castro">

<link  href="https://cdnjs.cloudflare.com/ajax/libs/twitter-bootstrap/3.3.5/css/bootstrap.min.css" rel="stylesheet">

</head>
<body>
<div id="content" class="container">
<div class="row"><div class="col-md-3 col-md-push-9"><nav id="table-of-contents">
<div id="text-table-of-contents" class="bs-docs-sidebar">
<ul class="nav">
<li><a href="#sec-1">1. Stacks</a>
<ul class="nav">
<li><a href="#sec-1-1">1.1. Discusión sobre Stacks</a></li>
<li><a href="#sec-1-2">1.2. Implementación en Código</a></li>
</ul>
</li>
</ul>
</div>
</nav>
</div><div class="col-md-9 col-md-pull-3"><h1 class="title"></h1>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Stacks</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> Discusión sobre Stacks</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Una pila (<i>Stack</i>) es una estructura
lineal de una solo lado que modela una pila de cosas que van poniendose
una encima de la otra, tienen dos operaciones primarias <code>push=y =pop</code>.
</p>

<pre class="example">
  flowchart TD    
      subgraph Pop
      id4(data) 
      end
      subgraph Stack
      id1(data) --&gt; id2(data) --&gt; id3(data)
      end
      subgraph Push
      id5(data)
      end
      id1 --&gt; Pop
      Push --&gt; Stack
</pre>
</div>

<div id="outline-container-sec-1-1-1" class="outline-4">
<h4 id="sec-1-1-1"><span class="section-number-4">1.1.1</span> ¿Que es un Stack?</h4>
<div class="outline-text-4" id="text-1-1-1">
</div><ol class="org-ol"><li><a id="sec-1-1-1-1" name="sec-1-1-1-1"></a>Instrucciones<br ><div class="outline-text-5" id="text-1-1-1-1">
<p>
Teniendo el siguente stack
</p>

<pre class="example">
  flowchart TD
      subgraph Stack
      Potato --&gt; Cabbage --&gt; Garlic --&gt; Apple
      end
</pre>

<ul class="org-ul">
<li>Si hacemos la operación <code>pop()</code> tendremos.
</li>
</ul>

<pre class="example">
  flowchart TD
  subgraph Stack
      potato --&gt; cabbage --&gt; garlic   
      end
</pre>

<ul class="org-ul">
<li>Si hacemos la operación <code>push('Onion')</code>
</li>
</ul>

<pre class="example">
  flowchart TD
  subgraph Stack
      potato --&gt; cabbage --&gt; garlic --&gt; Onion
      end
</pre>

<ul class="org-ul">
<li>Si hacemos la operación <code>push('Celery')</code>
</li>
</ul>

<pre class="example">
  flowchart TD
  subgraph Stack
      potato --&gt; cabbage --&gt; garlic --&gt; Onion --&gt; Celery
      end
</pre>

<ul class="org-ul">
<li>Si hacemos la operación <code>pop()</code>
</li>
</ul>

<pre class="example">
  flowchart TD
  subgraph Stack
      potato --&gt; cabbage --&gt; garlic --&gt; Onion
      end
</pre>
</div>
</li></ol>
</div>

<div id="outline-container-sec-1-1-2" class="outline-4">
<h4 id="sec-1-1-2"><span class="section-number-4">1.1.2</span> ¿Cuándo y dónde son usados los Stacks?</h4>
<div class="outline-text-4" id="text-1-1-2">
<ul class="org-ul">
<li>Usados en mecanismos de <i>undo</i> en editores de texto.
</li>
<li>Usados en compiladores en el chequeo de síntaxis de corchetes,
parentesis y llaves.
</li>
<li>Puede ser usado para modelar una pila de libros o de platos.
</li>
<li>Usado para soportar recursividad manteniendo un seguimiento de
llamadas a la función previas.
</li>
<li>Puede ser usado para hacer una <i>Depth First Search (DFS)</i> en un grafo.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1-1-3" class="outline-4">
<h4 id="sec-1-1-3"><span class="section-number-4">1.1.3</span> Análisis de complejidad</h4>
<div class="outline-text-4" id="text-1-1-3">
<table class="table table-striped table-bordered table-hover table-condensed">


<colgroup>
<col  class="left">

<col  class="left">
</colgroup>
<thead>
<tr>
<th scope="col" class="text-left">Operación</th>
<th scope="col" class="text-left">Complejidad</th>
</tr>
</thead>
<tbody>
<tr>
<td class="text-left">Pushing</td>
<td class="text-left">\(`O(1)`\)</td>
</tr>

<tr>
<td class="text-left">Poping</td>
<td class="text-left">\(`O(1)`\)</td>
</tr>

<tr>
<td class="text-left">Peeking</td>
<td class="text-left">\(`O(1)`\)</td>
</tr>

<tr>
<td class="text-left">Searching</td>
<td class="text-left">\(`O(n)`\)</td>
</tr>

<tr>
<td class="text-left">Size</td>
<td class="text-left">\(`O(1)`\)</td>
</tr>
</tbody>
</table>

<blockquote>
<p>
Asumiendo que la implementación del stack fue mediante una link list.
</p>
</blockquote>
</div>
</div>

<div id="outline-container-sec-1-1-4" class="outline-4">
<h4 id="sec-1-1-4"><span class="section-number-4">1.1.4</span> Ejemplos de uso</h4>
<div class="outline-text-4" id="text-1-1-4">
</div><ol class="org-ol"><li><a id="sec-1-1-4-1" name="sec-1-1-4-1"></a>Brackets<br ><div class="outline-text-5" id="text-1-1-4-1">
<p>
<b>Problema:</b> Dado un string hecho con los siguentes caracteres <code>()</code> <code>{}</code>
<code>[]</code>, Determina si estos estan cerrados de manera correcta.
</p>

<pre class="example">
  [{}] --&gt; Valid
  (() ()) --&gt; Valid
  {] --&gt; Invalid
  [()]))() --&gt; Invalid
  []{}({}) --&gt; Valid
</pre>

<p>
Secuencia de Brackets: <code>[[{}]()}</code>
</p>

<p>
Si metemos los elementos del string uno a uno en un stack, si
encontramos el caracter que lo cierra popeamos este caracter del stack
</p>

<pre class="example">
  String:[
  Stack:['[']

  String:[[
  Stack:['[','[']

  String:[[{
  Stack:['[','[','{']

  String:[[{}
  Stack:['[','[']

  String:[[{}]
  Stack:['[']

  String:[[{}](
  Stack:['[','(']

  String:[[{}()
  Stack:['[']

  String:[[{}()]
  Stack:[]
</pre>

<p>
Si al final tenemos el stack vacio, la secuencia es correcta y no hay
brackets sin cerrar.
</p>
</div>

<ol class="org-ol"><li><a id="sec-1-1-4-1-1" name="sec-1-1-4-1-1"></a>Implementación en código:<br ><div class="outline-text-6" id="text-1-1-4-1-1">
<div class="org-src-container">

<pre class="src src-java">  <span style="color: #6272a4; font-style: italic;">//Let S be a Stack</span>
  <span style="color: #bd93f9;">For</span> bracket <span style="color: #bd93f9;">in</span> bracket_string:
      rev = <span style="color: #50fa7b;">getReversedBracket</span><span style="color: #61bfff;">(</span>bracket<span style="color: #61bfff;">)</span>

      <span style="color: #bd93f9;">If</span> isLeftBracket<span style="color: #61bfff;">(</span>bracket<span style="color: #61bfff;">)</span>:
          <span style="color: #8be9fd;">S</span>.<span style="color: #50fa7b;">push</span><span style="color: #61bfff;">(</span>bracket<span style="color: #61bfff;">)</span>
      
      <span style="color: #bd93f9;">Else</span> If <span style="color: #8be9fd;">S</span>.<span style="color: #50fa7b;">isEmply</span><span style="color: #61bfff;">()</span> <span style="color: #bd93f9;">or</span> <span style="color: #8be9fd;">S</span>.pop<span style="color: #61bfff;">()</span> != rev:
          <span style="color: #ff79c6; font-style: italic;">return</span> <span style="color: #ffb86c;">false</span> <span style="color: #6272a4; font-style: italic;">//invalid</span>

  <span style="color: #ff79c6; font-style: italic;">return</span> <span style="color: #8be9fd;">S</span>.<span style="color: #50fa7b;">isEmpty</span><span style="color: #61bfff;">()</span> <span style="color: #6272a4; font-style: italic;">//Valid if S is emply </span>
</pre>
</div>
</div>
</li></ol>
</li></ol>
</div>
</div>

<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> Implementación en Código</h3>
<div class="outline-text-3" id="text-1-2">
<p>
Los stackst son normalmente implementados mediante arrays, singly linked
list o como doubly linked list. &gt; Usando una DLL
</p>

<div class="org-src-container">

<pre class="src src-java">  <span style="color: #6272a4; font-style: italic;">/**</span>
<span style="color: #6272a4; font-style: italic;">   * A linked list implementation of a stack</span>
<span style="color: #6272a4; font-style: italic;">   *</span>
<span style="color: #6272a4; font-style: italic;">   * @author William Fiset, william.alexandre.fiset@gmail.com</span>
<span style="color: #6272a4; font-style: italic;">   */</span>
  <span style="color: #ff79c6; font-style: italic;">package</span> com.williamfiset.algorithms.datastructures.stack;

  <span style="color: #ff79c6; font-style: italic;">public</span> <span style="color: #ff79c6; font-style: italic;">class</span> <span style="color: #bd93f9;">ListStack</span><span style="color: #61bfff;">&lt;</span><span style="color: #bd93f9;">T</span><span style="color: #61bfff;">&gt;</span> <span style="color: #ff79c6; font-style: italic;">implements</span> <span style="color: #bd93f9;">Iterable</span><span style="color: #61bfff;">&lt;</span><span style="color: #bd93f9;">T</span><span style="color: #61bfff;">&gt;</span>, <span style="color: #bd93f9;">Stack</span><span style="color: #61bfff;">&lt;</span><span style="color: #bd93f9;">T</span><span style="color: #61bfff;">&gt;</span> <span style="color: #61bfff;">{</span>

    <span style="color: #ff79c6; font-style: italic;">private</span> <span style="color: #bd93f9;">java</span>.<span style="color: #bd93f9;">util</span>.<span style="color: #bd93f9;">LinkedList</span><span style="color: #ff79c6;">&lt;</span><span style="color: #bd93f9;">T</span><span style="color: #ff79c6;">&gt;</span> list = <span style="color: #ff79c6; font-style: italic;">new</span> <span style="color: #bd93f9;">java</span>.<span style="color: #bd93f9;">util</span>.<span style="color: #bd93f9;">LinkedList</span><span style="color: #ff79c6;">&lt;</span><span style="color: #bd93f9;">T</span><span style="color: #ff79c6;">&gt;()</span>;

    <span style="color: #6272a4; font-style: italic;">// Create an empty stack</span>
    <span style="color: #ff79c6; font-style: italic;">public</span> <span style="color: #bd93f9;">ListStack</span><span style="color: #ff79c6;">()</span> <span style="color: #ff79c6;">{}</span>

    <span style="color: #6272a4; font-style: italic;">// Create a Stack with an initial element</span>
    <span style="color: #ff79c6; font-style: italic;">public</span> <span style="color: #bd93f9;">ListStack</span><span style="color: #ff79c6;">(</span><span style="color: #bd93f9;">T</span> firstElem<span style="color: #ff79c6;">)</span> <span style="color: #ff79c6;">{</span>
      <span style="color: #50fa7b;">push</span><span style="color: #50fa7b;">(</span>firstElem<span style="color: #50fa7b;">)</span>;
    <span style="color: #ff79c6;">}</span>

    <span style="color: #6272a4; font-style: italic;">// Return the number of elements in the stack</span>
    <span style="color: #ff79c6; font-style: italic;">public</span> <span style="color: #ffb86c;">int</span> <span style="color: #50fa7b;">size</span><span style="color: #ff79c6;">()</span> <span style="color: #ff79c6;">{</span>
      <span style="color: #ff79c6; font-style: italic;">return</span> list.<span style="color: #50fa7b;">size</span><span style="color: #50fa7b;">()</span>;
    <span style="color: #ff79c6;">}</span>

    <span style="color: #6272a4; font-style: italic;">// Check if the stack is empty</span>
    <span style="color: #ff79c6; font-style: italic;">public</span> <span style="color: #ffb86c;">boolean</span> <span style="color: #50fa7b;">isEmpty</span><span style="color: #ff79c6;">()</span> <span style="color: #ff79c6;">{</span>
      <span style="color: #ff79c6; font-style: italic;">return</span> <span style="color: #50fa7b;">size</span><span style="color: #50fa7b;">()</span> == <span style="color: #8be9fd;">0</span>;
    <span style="color: #ff79c6;">}</span>

    <span style="color: #6272a4; font-style: italic;">// Push an element on the stack</span>
    <span style="color: #ff79c6; font-style: italic;">public</span> <span style="color: #ffb86c;">void</span> <span style="color: #50fa7b;">push</span><span style="color: #ff79c6;">(</span><span style="color: #bd93f9;">T</span> elem<span style="color: #ff79c6;">)</span> <span style="color: #ff79c6;">{</span>
      list.<span style="color: #50fa7b;">addLast</span><span style="color: #50fa7b;">(</span>elem<span style="color: #50fa7b;">)</span>;
    <span style="color: #ff79c6;">}</span>

    <span style="color: #6272a4; font-style: italic;">// Pop an element off the stack</span>
    <span style="color: #6272a4; font-style: italic;">// Throws an error is the stack is empty</span>
    <span style="color: #ff79c6; font-style: italic;">public</span> <span style="color: #bd93f9;">T</span> <span style="color: #50fa7b;">pop</span><span style="color: #ff79c6;">()</span> <span style="color: #ff79c6;">{</span>
      <span style="color: #ff79c6; font-style: italic;">if</span> <span style="color: #50fa7b;">(</span><span style="color: #50fa7b;">isEmpty</span><span style="color: #bd93f9;">()</span><span style="color: #50fa7b;">)</span> <span style="color: #ff79c6; font-style: italic;">throw</span> <span style="color: #ff79c6; font-style: italic;">new</span> <span style="color: #bd93f9;">java</span>.<span style="color: #bd93f9;">util</span>.<span style="color: #bd93f9;">EmptyStackException</span><span style="color: #50fa7b;">()</span>;
      <span style="color: #ff79c6; font-style: italic;">return</span> list.<span style="color: #50fa7b;">removeLast</span><span style="color: #50fa7b;">()</span>;
    <span style="color: #ff79c6;">}</span>

    <span style="color: #6272a4; font-style: italic;">// Peek the top of the stack without removing an element</span>
    <span style="color: #6272a4; font-style: italic;">// Throws an exception if the stack is empty</span>
    <span style="color: #ff79c6; font-style: italic;">public</span> <span style="color: #bd93f9;">T</span> <span style="color: #50fa7b;">peek</span><span style="color: #ff79c6;">()</span> <span style="color: #ff79c6;">{</span>
      <span style="color: #ff79c6; font-style: italic;">if</span> <span style="color: #50fa7b;">(</span><span style="color: #50fa7b;">isEmpty</span><span style="color: #bd93f9;">()</span><span style="color: #50fa7b;">)</span> <span style="color: #ff79c6; font-style: italic;">throw</span> <span style="color: #ff79c6; font-style: italic;">new</span> <span style="color: #bd93f9;">java</span>.<span style="color: #bd93f9;">util</span>.<span style="color: #bd93f9;">EmptyStackException</span><span style="color: #50fa7b;">()</span>;
      <span style="color: #ff79c6; font-style: italic;">return</span> list.<span style="color: #50fa7b;">peekLast</span><span style="color: #50fa7b;">()</span>;
    <span style="color: #ff79c6;">}</span>

    <span style="color: #6272a4; font-style: italic;">// Allow users to iterate through the stack using an iterator</span>
    <span style="color: #ff79c6; font-style: italic;">@</span><span style="color: #bd93f9; font-weight: bold;">Override</span>
    <span style="color: #ff79c6; font-style: italic;">public</span> <span style="color: #bd93f9;">java</span>.<span style="color: #bd93f9;">util</span>.<span style="color: #bd93f9;">Iterator</span><span style="color: #ff79c6;">&lt;</span><span style="color: #bd93f9;">T</span><span style="color: #ff79c6;">&gt;</span> <span style="color: #50fa7b;">iterator</span><span style="color: #ff79c6;">()</span> <span style="color: #ff79c6;">{</span>
      <span style="color: #ff79c6; font-style: italic;">return</span> list.<span style="color: #50fa7b;">iterator</span><span style="color: #50fa7b;">()</span>;
    <span style="color: #ff79c6;">}</span>
  <span style="color: #61bfff;">}</span>
</pre>
</div>
</div>
</div>
</div>
</div></div></div>
<footer id="postamble" class="">
<div><p class="author">Author: J.D Castro</p>
<p class="date">Created: 2022-10-08 Sat 18:56</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 28.1.50 (<a href="http://orgmode.org">Org-mode</a> 9.6)</p>
</div>
</footer>
</body>
</html>
